tap "bazelbuild/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "universal-ctags/universal-ctags"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# General-purpose data compression with high compression ratio
brew "xz"
# High dynamic-range image file format
brew "openexr"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Software library to render fonts
brew "freetype"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk@11"
# Google's own build tool
brew "bazel"
# Parser generator
brew "bison"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Framework for layout and rendering of i18n text
brew "pango"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Generic syntax highlighter
brew "pygments"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Julia installer and version multiplexer
brew "juliaup"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Pager program similar to more
brew "less"
# Conversion library
brew "libiconv"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Manage compile and link flags for libraries
brew "pkg-config"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Intuitive find & replace CLI
brew "sd"
# Tool Command Language
brew "tcl-tk"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher", link: false
# Code-search similar to ack
brew "the_silver_searcher"
# Maintained ctags implementation
brew "universal-ctags"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
mas "BBEdit", id: 404009241
