tap "bazelbuild/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Software library to render fonts
brew "freetype"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Modern replacement for 'ls'
brew "exa"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU triangulated surface library
brew "gts"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Generic syntax highlighter
brew "pygments"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Pager program similar to more
brew "less"
# Conversion library
brew "libiconv"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# Mac App Store command-line interface
brew "mas"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Development kit for the Java programming language
brew "openjdk@11"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Manage compile and link flags for libraries
brew "pkg-config"
# Code-search similar to ack
brew "the_silver_searcher"
# Maintained ctags implementation
brew "universal-ctags"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Google's own build tool
brew "bazelbuild/tap/bazel"
mas "BBEdit", id: 404009241
